{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 543, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.gather", "trainable": true, "dtype": "float32", "function": "compat.v1.gather"}, "name": "tf.compat.v1.gather", "inbound_nodes": [["inputs", 0, 0, {"indices": [0, 9, 11, 13, 14, 17, 117, 118, 119, 199, 346, 347, 348, 468, 469, 470, 471, 472, 473, 474, 475, 476, 477, 478, 479, 480, 481, 482, 483, 484, 485, 486, 487, 488, 489, 490, 491, 492, 493, 494, 495, 496, 497, 498, 499, 500, 501, 502, 503, 504, 505, 506, 507, 508, 509, 510, 511, 512, 513, 514, 515, 516, 517, 518, 519, 520, 521, 522, 523, 524, 525, 526, 527, 528, 529, 530, 531, 532, 533, 534, 535, 536, 537, 538, 539, 540, 541, 542], "validate_indices": null, "name": null, "axis": 1, "batch_dims": 0}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.is_nan", "trainable": true, "dtype": "float32", "function": "math.is_nan"}, "name": "tf.math.is_nan", "inbound_nodes": [["tf.compat.v1.gather", 0, 0, {"name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.zeros_like", "trainable": true, "dtype": "float32", "function": "zeros_like"}, "name": "tf.zeros_like", "inbound_nodes": [["tf.compat.v1.gather", 0, 0, {}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.where", "trainable": true, "dtype": "float32", "function": "where"}, "name": "tf.where", "inbound_nodes": [["tf.math.is_nan", 0, 0, {"x": ["tf.zeros_like", 0, 0], "y": ["tf.compat.v1.gather", 0, 0]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["tf.where", 0, 0, {"slice_spec": [{"class_name": "__ellipsis__"}, 0]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_1", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_1", "inbound_nodes": [["tf.where", 0, 0, {"slice_spec": [{"class_name": "__ellipsis__"}, 1]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_2", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_2", "inbound_nodes": [["tf.where", 0, 0, {"slice_spec": [{"class_name": "__ellipsis__"}, 2]}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.concat", "trainable": true, "dtype": "float32", "function": "concat"}, "name": "tf.concat", "inbound_nodes": [[["tf.__operators__.getitem", 0, 0, {"axis": -1}], ["tf.__operators__.getitem_1", 0, 0, {"axis": -1}], ["tf.__operators__.getitem_2", 0, 0, {"axis": -1}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.expand_dims", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "name": "tf.expand_dims", "inbound_nodes": [["tf.concat", 0, 0, {"axis": 0}]]}, {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 264], "dtype": "float32", "sparse": false, "ragged": true, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation", "inbound_nodes": [[["layer_normalization", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 256, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "layer_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["layer_normalization_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 250, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 27}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 28}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 29}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 250, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["lstm", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "name": "model", "inbound_nodes": [[["tf.expand_dims", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "outputs", "trainable": true, "dtype": "float32", "activation": "linear"}, "name": "outputs", "inbound_nodes": [[["model", 1, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["outputs", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>RMSprop", "config": {"name": "RMSprop", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": 100, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "rho": 0.9, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [264, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "layer_normalization/gamma", "shape": [512], "dtype": "float32"}, {"name": "layer_normalization/beta", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_1/gamma", "shape": [256], "dtype": "float32"}, {"name": "layer_normalization_1/beta", "shape": [256], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [256, 1000], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [250, 1000], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [1000], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [250, 250], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [250], "dtype": "float32"}]}]}